udpate docs, add mermaid diagrams
